<head>
    <meta name="viewport" content="width=device-width, initial-scale=1.0, minimum-scale=1.0, user-scalable=yes">
	<style>
		h1 {
			color: red;
			text-align: center;
		}
		p.questionTitle {
			font-size: 30px;
			text-align: center;
            max-width: 100%;
            max-height: 10vw;
		}
		p.answerTitle {
			font-size: 30px;
			text-align: center;
            max-width: 100%;
            max-height: 10vw;
		}
        p.question{
            text-align: center;
            font-size: 35px;
            max-width: 100%;
            max-height: 10vw;
        }
        p.answer{
            text-align: center;
            color: red;
            font-size: 35px;
            max-width: 100%;
            max-height: 40vw;
        }
		p.TorF {
			font-size: 100px;
			color: red;
			margin-top: -110px;
			text-align: center;
		}
		h2 {
			text-align: center;
		}
		.button {
			display: block;
			width: 250px;
			height: 70px;
			line-height: 70px;
			color: #FFF;
			text-decoration: none;
			background-color: #f39800;
			border-radius: 5px;
			-webkit-transition: all 0.5s;
			transition: all 0.5s;
            position: absolute;
            bottom: 5vw;
            left: 50%;
            right: 0;
            margin: auto;
		}
        .button_menu {
			display: block;
			width: 250px;
			height: 70px;
			line-height: 70px;
			color: #FFF;
			text-decoration: none;
			background-color: #f39800;
			border-radius: 5px;
			-webkit-transition: all 0.5s;
			transition: all 0.5s;
            position: absolute;
            bottom: 5vw;
            left: 0;
            right: 50%;
            margin: auto;
		}
		.button:hover {
			background-color: #f9c500;
		}
		.form-conf {
			text-align: center;
		}
		.form-conf form {
			display: inline-block;
			margin: 0 10px;
		}
		p.description {
			text-align: center;
			font-size: 30px;
		}
        p {
            max-height: 20vw;
            max-width: 20vw;
        }
	</style>
</head>

<body>
	<?php


        $questions_list=["１：啓蒙",
        "２：遺憾なく",
        "３：常軌を逸して",
        "４：包摂",
        "５：歴然",
        "６：準拠",
        "７：婉曲",
        "８：膾炙",
        "９：踏襲",
        "１０：勘案",
        "１１：添削",
        "１２：含蓄に富む",
        "１３：癒着",
        "１４：福音",
        "１５：帰納",
        "１６：批准",
        "１７：吐露",
        "１８：虚心",
        "１９：薫陶",
        "２０：炯眼",
        "２１：露呈",
        "２２：啓示",
        "２３：風潮",
        "２４：鼓舞",
        "２５：錯誤",
        "２６：委嘱",
        "２７：紐帯",
        "２８：滋味",
        "２９：称揚",
        "３０：典拠",
        "３１：忖度",
        "３２：彫琢",
        "３３：通底",
        "３４：割愛",
        "３５：釈然",
        "３６：騰貴",
        "３７：及第",
        "３８：反芻",
        "３９：看破",
        "４０：吟味",
        "４１：アイコン",
        "４２：アイテム",
        "４３：アイデンティティ",
        "４４：アイロニー",
        "４５：アーカイブ",
        "４６：アニミズム",
        "４７：アフォリズム",
        "４８：アンニュイ",
        "４９：アナーキズム",
        "５０：アパシー",
        "５１：アンビバレント",
        "５２：アンチテーゼ",
        "５３：アプローチ",
        "５４：アレゴリー",
        "５５：イデア",
        "５６：イデオロギー",
        "５７：イノベーション",
        "５８：イニシエーション",
        "５９：エキシビション",
        "６０：エキゾチック",
        "６１：エゴ",
        "６２：エレメント",
        "６３：エコノミー",
        "６４：エコロジー",
        "６５：エスプリ",
        "６６：オーソリティー",
        "６７：オプチミスト",
        "６８：カオス",
        "６９：カスタマー",
        "７０：カタルシス",
        "７１：カテゴリー",
        "７２：カリスマ",
        "７３：グローバル",
        "７４：コスモス",
        "７５：コネクション",
        "７６：コミュニティ",
        "７７：コモンセンス",
        "７８：コロニアル",
        "７９：コンサバティブ",
        "８０：コンセンサス",
        "８１：コンテキスト",
        "８２：コンセプト",
        "８３：コントラスト",
        "８４：コンプライアンス",
        "８５：シナジー",
        "８６：シニカル",
        "８７：シメトリー",
        "８８：ジレンマ",
        "８９：ジェンダー",
        "９０：ジャーナリズム",
        "９１：シャーマニズム",
        "９２：シュールレアリスム",
        "９３：ジャンル",
        "９４：スタンス",
        "９５：ストイック",
        "９６：スローガン",
        "９７：ニヒリズム",
        "９８：ノスタルジー",
        "９９：ニュアンス",
        "１００：ダイナミズム",
        "１０１：髣髴",
        "１０２：鷹揚",
        "１０３：具現化",
        "１０４：補填",
        "１０５：矛盾",
        "１０６：傾倒",
        "１０７：中庸",
        "１０８：肝要",
        "１０９：徒に",
        "１１０：夭折",
        "１１１：オプティミズム",
        "１１２：ニヒリズム",
        "１１３：シニカル",
        "１１４：ナイーブ",
        "１１５：ストイック",
        "１１６：フェティシズム",
        "１１７：ニュートラル",
        "１１８：リベラル",
        "１１９：ラディカル",
        "１２０：アナーキー",
        "１２１：アナクロニズム",
        "１２２：プリミティブ",
        "１２３：エッセンス",
        "１２４：コスモロジー",
        "１２５：アカデミズム",
        "１２６：ぺダンティック",
        "１２７：シミュレーション ",
        "１２８：フィードバック",
        "１２９：コンセプト",
        "１３０：プロローグ",
        "１３１：カタストロフ",
        "１３２：ダイナミズム",
        "１３３：パトロン",
        "１３４：シュールレアリスム",
        "１３５：エクリチュール",
        "１３６：メディア・リテラシー",
        "１３７：モード",
        "１３８：ダブル・スタンダード",
        "１３９：クレオール",
        "１４０：ノスタルジー",
        "１４１：パトス",
        "１４２：エートス",
        "１４３：トポス",
        "１４４：アプリオリ",
        "１４５：アンチテーゼ",
        "１４６：アポリア",
        "１４７：コミュニティ",
        "１４８：ローカル",
        "１４９：マクロ",
        "１５０：インフラストラクチャー",
        "１５１：ヒエラルキー",
        "１５２：ユートピア",
        "１５３：エスニシティ",
        "１５４：ジェンダー",
        "１５５：セクシュアリティ",
        "１５６：ボーダーレス",
        "１５７：バイアス",
        "１５８：モラトリアム"
        ];

        $answers_list=["１：無知な人を啓発して教え導くこと",
        "２：申し分なく・十分に",
        "３：常識外れの行動をとる",
        "４：ある事柄を一定の範囲内に包み込むこと",
        "５：ありありとして明白なさま",
        "６：拠り所として従うこと",
        "７：はっきりと表現せず遠まわしに言うさま",
        "８：広く知れ渡っていること",
        "９：それまでのやり方を受け継ぐこと",
        "１０：あれこれ考え合わせること",
        "１１：文章などを改め直すこと",
        "１２：深い意味が含まれていること",
        "１３：本来関係あるべきでない者同士が手を結ぶこと",
        "１４：喜ばしい知らせ",
        "１５：個々の具体的な事実から一般的な法則を導き出すこと",
        "１６：条約を確認し同意すること",
        "１７：思いを隠さず述べること",
        "１８：わだかまりのない心・素直な心",
        "１９：優れた徳で人を感化し影響を与えること",
        "２０：眼力が鋭いこと・洞察力が優れていること",
        "２１：隠れているものが外に表れ出ること",
        "２２：神が現し示すこと・諭し示すこと",
        "２３：時代によって移り変わる世の中の傾向",
        "２４：人の気を奮い立たせること",
        "２５：誤り・間違い",
        "２６：外部の人に仕事を任せ頼むこと",
        "２７：二つの物を結びつけるもの",
        "２８：物事の豊かな深い味わい",
        "２９：褒め称えること",
        "３０：言葉や文章の拠り所となる文献・出典",
        "３１：他人の心中を推し量ること",
        "３２：文章に磨きを掛けること",
        "３３：二つ以上の事柄が基底の部分で共通性を持っていること",
        "３４：惜しいと思う物を思い切って省いたり手放したりすること",
        "３５：疑いや恨みが解けてすっきりするさま",
        "３６：物価や相場が上がること",
        "３７：試験に合格すること",
        "３８：何度も繰り返して考え味わうこと",
        "３９：隠れていることを見破ること",
        "４０：物事を詳しく調べて選ぶこと",
        "４１：象徴的なもの・偶像",
        "４２：品目・項目・条項",
        "４３：自己同一性・主体性",
        "４４：皮肉・風刺",
        "４５：記録や資料",
        "４６：精霊信仰",
        "４７：警句・格言",
        "４８：倦怠感・退屈・もの憂いさま",
        "４９：無政府主義",
        "５０：感情純麻",
        "５１：相反する感情を持つ様子",
        "５２：反対のための理論・主張",
        "５３：接近・近づくこと・対象に近づく方法",
        "５４：寓喩",
        "５５：理念・観念",
        "５６：観念形態・思想傾向・政治思想",
        "５７：技術革新",
        "５８：通過儀礼",
        "５９：公開・展示",
        "６０：異国風・異国情緒",
        "６１：自己・自我",
        "６２：要素・成分・化学元素",
        "６３：倹約・経済的",
        "６４：生態学",
        "６５：機智",
        "６６：その分野の第一人者・権威",
        "６７：楽天家・楽観主義者",
        "６８：混沌・無秩序",
        "６９：顧客・得意先",
        "７０：精神的な解放感",
        "７１：範疇・尺度",
        "７２：人に支持される強い魅力",
        "７３：国家間を超えた地球規模",
        "７４：宇宙",
        "７５：縁故・つながり",
        "７６：人々のつながり",
        "７７：常識・良識",
        "７８：植民地風の",
        "７９：保守的な・保守層",
        "８０：合意・同意",
        "８１：文脈",
        "８２：概念・意図・構想",
        "８３：対照・対比",
        "８４：法令遵守",
        "８５：共同作用・相乗作用",
        "８６：皮肉な態度",
        "８７：左右対称",
        "８８：板挟み",
        "８９：社会的性差",
        "９０：報道活動の総称",
        "９１：巫者を中心とする信仰",
        "９２：超現実主義",
        "９３：種類・領域",
        "９４：立場・位置・態度",
        "９５：禁欲的",
        "９６：標語・宣伝文句",
        "９７：虚無主義",
        "９８：郷愁・懐かしい思い",
        "９９：微妙な意味合い",
        "１００：力強さ・迫力",
        "１０１：よく似ているさま・ありありと思い浮かぶさま",
        "１０２：ゆったりと落ち着いていること",
        "１０３：実際の形になって現れること",
        "１０４：不足を補うこと",
        "１０５：二つの事柄のつじつまが合わないこと",
        "１０６：ある人や物事に心を傾けて熱中すること",
        "１０７：偏りがなく常に変わらないこと",
        "１０８：非常に大切なこと",
        "１０９：無駄に・虚しく",
        "１１０：年が若くて死ぬこと",
        "１１１：楽観主義。楽観論",
        "１１２：虚無主義",
        "１１３：皮肉な。冷笑的な",
        "１１４：素直で傷つきやすい。無邪気な。素朴な",
        "１１５：禁欲的",
        "１１６：呪物崇拝。物神崇拝",
        "１１７：中立の。不偏不党の",
        "１１８：自由主義の。自由を重んじる。偏見のない",
        "１１９：過激な。急進的な。根本的な",
        "１２０：無秩序なさま。無政府主義",
        "１２１：時代錯誤",
        "１２２：原始的。素朴なさま",
        "１２３：本質。精髄",
        "１２４：宇宙論",
        "１２５：学問や芸術の純粋性・正統性を守ろうとする立場。学問の世界。",
        "１２６：学識を誇示し、ひけらかすさま",
        "１２７：仮想現実。模擬実験",
        "１２８：結果を参考に、その原因を修正し、調整していくこと",
        "１２９：概念。基本理念",
        "１３０：序章。導入部",
        "１３１：突然の大変動。破局",
        "１３２：力強さ。運動の仕組み",
        "１３３：経済的な支援者",
        "１３４：超現実主義",
        "１３５：書くこと。書かれたもの",
        "１３６：メディアの情報を識別し、活用する能力",
        "１３７：方法。状態。流行",
        "１３８：二重基準",
        "１３９：母語として用いられる混成語",
        "１４０：郷愁。懐古趣味",
        "１４１：感情。情念。情熱",
        "１４２：性格。気風",
        "１４３：場所。場",
        "１４４：経験に先立って。先験的。先天的",
        "１４５：反対命題。反措定",
        "１４６：解決できない難問",
        "１４７：共同体。地域社会",
        "１４８：地元の。局所的な",
        "１４９：巨視的な。大きな",
        "１５０：社会生活の基盤となる施設。インフラ。",
        "１５１：階層秩序",
        "１５２：理想郷",
        "１５３：言語・文化を共有する集団への帰属意識。民族性。",
        "１５４：社会的・文化的につくられた性別や性差",
        "１５５：人間の性のあり方の総称。セクシャリティ",
        "１５６：境界がないこと。国境がないこと",
        "１５７：先入観。偏見。バイヤス",
        "１５８：（物事の遂行や支払いの）猶予"
        ];

		function outputQuestion($num,$question){
			?><p class="question"><?php echo $question[$num]; ?></p>
<?php
		}
		function outputAnswer($num,$answer){
            ?><p class="answer"><?php echo $answer[$num]; ?>
            <br><br><b></p>
<?php
		}
		function reset_num($questions_list){
            $num_max=count($questions_list);
            $nums_question=array();
            for($i=0;$i<158;$i++){
                array_push($nums_question,$i);
            }
			shuffle($nums_question);
			$str_num='';
			foreach($nums_question as $num){
				$str_num=$str_num.$num.',';
			}
			return $str_num;
		}
			?>
			<h1>日本語　試験対策ALL</h1>
			<h2>語句</h2>
			<?php
				$str_num=$_POST["nums_question"];
				$num_qu = $_POST["num"];
				if (is_null($num_qu)){
					$str_num = reset_num($questions_list);
					$num_qu = 0;
				}
				$num_qu+=1;
				if ($num_qu>=count($questions_list)){
					$str_num = reset_num($questions_list);
					$num_qu = 0;
				}
				$nums_question=explode(',', $str_num);
				$num = array_search((string)$num_qu , $nums_question);
		
				outputQuestion($num,$questions_list);
				outputAnswer($num,$answers_list);
			?>
			
			<div class="form-conf">
				<form method="POST" action="menu.html">        
					<input class="button_menu" type="submit" value="menu" name="sub3">
				</form>
		
				<form method="POST" action="#">
					<input type="hidden" name="nums_question" value="<?php echo $str_num; ?>">
					<input type="hidden" name="num" value="<?php echo $num_qu; ?>">
					<input class="button" type="submit" value="next" name="sub2">
				</form>
			</div>
		</body>